# -*- coding: utf-8 -*-
# =============================================================================
# #1.分解质因数
# num = int(input())
# i = 2
# while num != 1:
#     if num % i == 0:
#         print(i)
#         num //= i
#     else:
#         i += 1
# 
# 
# 
# 
# =============================================================================
# =============================================================================
# #计算有多少个单词
# str = input()
# str1 = str.strip()
# index = 0
# count = 0
# while index < len(str1):
#     while str[index] != " ":
#         index += 1
#         if index == len(str1):
#             break
#     
#     count += 1
#     
#     if index == len(str1):
#         break
#     
#     while str[index] == " ":
#         index += 1
# print(count)
# 
# =============================================================================
#打印99乘法表
#输入两个数，求这两个数的最大公约数
#输入一个字符串，将这个字符串中的大写字母转小写，将小写字母转大写
#随机生成一个6位数的验证码
#turtle 绘图  正方形  矩形  正方体  五角星  奥运五环  围棋棋盘  国际象棋棋盘














